(if (< 2 5)
  100
  15)

(when (> 5 2)
  5)

;;**************
(def m "v1")
(case m
  "v1" true
  "v2" false
  15)

;;**************
(def x 5)
(cond
  (> x 5) :s
  (< x 5) :5
  :else 5)

;;**************
;; do выполнит все 
;; аргументы и вернет 
;; результат поcледнего

(do
  1
  (println "123")
  3)

;;**************
;; when в случае если первый
;; аргумент true выполнит все 
;; последующие аргументы и 
;; вернет результат последнего

(when true
  (println "123")
  :no)

;;**************
;; Обьявление локальных для
;; директивы переменных
(let [x 10]
  (+ x 2))
(let [x (- (+ 5 3) (/ 3 5))]
  (+ x 2))
(let [x 11
      y (+ 1 x)
      z (+ 1 y x)]
  (+ x y z))

;;**************
;; цикл
(loop [x 10
       acc 0]
  (if (pos? x) 
    (do
      (println x acc)
       (recur (- x 1) (+ acc x)))
    acc))









